src/Catalogs/PaymentDeductionKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>PaymentDeductionKinds</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PaymentDeductionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountOfExpenses</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Formula</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/PaymentDeductionKinds/Forms/ItemForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// COMMON PROCEDURES AND FUNCTIONS

&AtClient
// Procedure sets accessibility of form items.
//
// Parameters:
//  No.
//
Procedure SetVisibilityAndAccessibility()
	
	Items.AccountOfExpenses.Visible 	= True;
	Items.GroupFormula.Visible 			= True;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// PROCEDURES - FORM EVENTS HANDLERS

&AtServer
// Procedure handler events OnCreateAtServer.
// Initial filling of form attributes.
//
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	Items.AccountOfExpenses.Visible = True;
	Items.GroupFormula.Visible = True;		
	
EndProcedure // OnCreateAtServer()

////////////////////////////////////////////////////////////////////////////////
// PROCEDURES - ACTIONS OF FORM COMMAND BARS

&AtClient
// Procedure is called on click button "Edit calculation formula".
//
Procedure CommandEditCalculationFormula(Command)
	                               
	StructureOfParameters = New Structure("FormulaText", Object.Formula);
	CFEForm				  = GetForm("Catalog.PaymentDeductionKinds.Form.CalculationFormulaEdirForm", StructureOfParameters);
    FormulaText 		  = CFEForm.DoModal();
  
	If TypeOf(FormulaText) = Type("String") Then

        Object.Formula = FormulaText;

	EndIf;
	
EndProcedure // CommandEditCalculationFormulaExecute()

////////////////////////////////////////////////////////////////////////////////
// PROCEDURES - EVENT HANDLERS OF FORM ATTRIBUTES

&AtClient
// Procedure handler of event OnChange of input field BusinessIndividual.
//
Procedure TypeOnChange(Item)
	
	SetVisibilityAndAccessibility();
	
EndProcedure // BusinessIndividualOnChange()
